project.org
#+title: An Powershell Repl for Emacs using the Windows terminal

The aim of this project is to setup functionality to let emacs interact with powershell running in Windows Terminal.
1. [ ] Send input to a running Windows Terminal with an powershell shell.
2. [ ] Use `eval/send-reigon-to-repl` to send text to a WT Powershell repl
3. [ ] Set breakpoints in the WT PS Repl using the current location in the file
4. [ ] Import the file into the WT PS Repl

 The Non-Goals of this project are:
5. To write  a pure elisp plugin.
6. To be completely self contained. It is ok if some manual tweaking is required every time you run it.

* First Iteration
** Sending lines to a running powershell process in windows terminal
I am hoping this is possible using powershell, so lets ask the AI to write it for us.

*** First Attempt, Writing to the Stdin of the process  = Complete shit
Ok, so the first powershell script looks sort of legit. But it just didn't work cause it did not support the use case I was going for. I've copied it bellow for reference.

#+begin_src markdown
[SYS]: You are a powershell developer

[ME]: Hi. Write a powershell function that writes an array of strings to the console of an other running powershell instance. The function should take an array of strings and an integer with the PID to the other powershell process as input. It should aquire the stdin handle to the powershell process and post the strings in the array one by one. Then it should release the stdin handle and detach from the process.

[AI]: Sure, here's an example function that should do what you're asking for:

```
function Send-StringsToProcess {
    [CmdletBinding()]
    param(
        [Parameter(Mandatory = $true)]
        [string[]]$StringsToSend,

        [Parameter(Mandatory = $true)]
        [int]$ProcessId
    )

    Begin {
        $psi = New-Object System.Diagnostics.ProcessStartInfo
        $psi.FileName = "powershell.exe"
        $psi.RedirectStandardInput = $true
        $psi.UseShellExecute = $false
        $process = [System.Diagnostics.Process]::GetProcessById($ProcessId)
    }

    Process {
        foreach ($string in $StringsToSend) {
            $processStdIn = $process.StandardInput
            $processStdIn.WriteLine($string)
        }
    }

    End {
        $processStdIn.Close()
        $processStdIn.Dispose()
    }
}
```

Here's how you can use the function:

1. Get the process Id of the other PowerShell process that you want to send the strings to. You can do this by opening Task Manager, right-clicking on the PowerShell process, and selecting "Go to details". The process Id is listed under the "Details" tab.

2. Open a PowerShell console and call the `Send-StringsToProcess` function with the array of strings you want to send and the process Id of the other PowerShell process:

```
$strings = @("String 1", "String 2", "String 3")
Send-StringsToProcess -StringsToSend $strings -ProcessId <other PowerShell process Id>
```

This should write each string in the array to the other PowerShell process's console window one by one.

Note that the other PowerShell process must be running as an interactive console application for this to work. If it's running in a non-interactive mode, such as from a scheduled task or Windows service, it won't have a stdin handle that can be written to.

[ME]: Thanks!

[AI]: You're welcome! Let me know if you have any other PowerShell questions or needs.

[ME]: Oh, and the script should be able to pick up the strings as command line arguments

[AI]: Sure, no problem. Here is an updated version of the `Send-StringsToProcess` function that can accept strings as command line arguments:

```
function Send-StringsToProcess {
    [CmdletBinding()]
    param(
        [Parameter(Mandatory = $true, Position = 0, ValueFromPipeline = $true)]
        [string[]]$StringsToSend,

        [Parameter(Mandatory = $true, Position = 1)]
        [int]$ProcessId
    )

    Begin {
        $psi = New-Object System.Diagnostics.ProcessStartInfo
        $psi.FileName = "powershell.exe"
        $psi.RedirectStandardInput = $true
        $psi.UseShellExecute = $false
        $process = [System.Diagnostics.Process]::GetProcessById($ProcessId)
    }

    Process {
        $strings = $StringsToSend[0].Split(" ")
        foreach ($string in $strings) {
            $processStdIn = $process.StandardInput
            $processStdIn.WriteLine($string)
        }
    }

    End {
        $processStdIn.Close()
        $processStdIn.Dispose()
    }
}
```

This updated function accepts input from the pipeline and splits the strings on white space to generate an array of strings that you can use to send to the other PowerShell process. Here is an example of how you can use the updated function:

`"Hello World" | Send-StringsToProcess -ProcessId <other PowerShell process Id>`

This example sends the string "Hello World" to the other PowerShell process.

You can also use the `-StringsToSend` parameter as before:

```
Send-StringsToProcess -StringsToSend "Hello World" -ProcessId <other PowerShell process Id>
```

This example also sends the string "Hello World" to the other PowerShell process.

Note that the same caveat applies as before regarding the other PowerShell process needing to be running as an interactive console application.

#+end_src

Well that does look promising but I think it will require some tweaking to get it working.

#+begin_src powershell
function Send-StringsToProcess {
    [CmdletBinding()]
    param(
        [Parameter(Mandatory = $true, Position = 0, ValueFromPipeline = $true)]
        [string[]]$StringsToSend,

        [Parameter(Mandatory = $true, Position = 1)]
        [int]$ProcessId
    )

    Begin {
        $psi = New-Object System.Diagnostics.ProcessStartInfo
        $psi.FileName = "powershell.exe"
        $psi.RedirectStandardInput = $true
        $psi.UseShellExecute = $false
        $process = [System.Diagnostics.Process]::GetProcessById($ProcessId)
    }

    Process {
        $strings = $StringsToSend[0].Split(" ")
        foreach ($string in $strings) {
            $processStdIn = $process.StandardInput
            $processStdIn.WriteLine($string)
        }
    }

    End {
        $processStdIn.Close()
        $processStdIn.Dispose()
    }
}
#+end_src
*** Second Attempt.
Ok, I wasted a lot of time on the first attempt. So rather than just one way this time I will try to different approaches simultaneously
**** First Idea; Use the console api to send data to the console.
Lets give it a try:
#+begin_ai
[SYS]: You are an expert windows developer.

[ME]: Write a powershell wich uses the Console API in kernel32.dll to attach to a running console and write an array of lines into its stdin.
After its finished it should detach and free the console again.

[AI]: Sure, here's an example PowerShell script that does what you're asking for:

```powershell
# Load the kernel32.dll library
Add-Type -Name ConsoleAPI -Namespace Kernel32 -MemberDefinition @"
[DllImport("kernel32.dll")]
public static extern bool AttachConsole(uint dwProcessId);
[DllImport("kernel32.dll")]
public static extern bool FreeConsole();
[DllImport("kernel32.dll")]
public static extern bool SetConsoleCtrlHandler(IntPtr handlerRoutine, bool add);
[DllImport("kernel32.dll")]
public static extern bool WriteConsoleInput(IntPtr hConsoleInput, INPUT_RECORD[] lpBuffer, uint nLength, out uint lpNumberOfEventsWritten);
public struct INPUT_RECORD {
    public ushort EventType;
    public KEY_EVENT_RECORD KeyEvent;
}
public struct KEY_EVENT_RECORD {
    public bool bKeyDown;
    public ushort wRepeatCount;
    public ushort wVirtualKeyCode;
    public ushort wVirtualScanCode;
    public char UnicodeChar;
    public uint dwControlKeyState;
}
"@

# Attach to an existing console
if (![Kernel32.ConsoleAPI]::AttachConsole(-1)) {
    Write-Error "Failed to attach to console."
    exit
}

# Create an array of lines to write to stdin
$lines = @("Hello, world!", "How are you?", "Goodbye.")

# Convert the lines to INPUT_RECORD structures
$records = @()
foreach ($line in $lines) {
    $chars = [char[]]$line
    foreach ($char in $chars) {
        $record = New-Object Kernel32.INPUT_RECORD
        $record.EventType = 1 # KEY_EVENT
        $record.KeyEvent.bKeyDown = $true
        $record.KeyEvent.UnicodeChar = $char
        $records += $record

        $record = New-Object Kernel32.INPUT_RECORD
        $record.EventType = 1 # KEY_EVENT
        $record.KeyEvent.bKeyDown = $false
        $record.KeyEvent.UnicodeChar = $char
        $records += $record
    }
    $record = New-Object Kernel32.INPUT_RECORD
    $record.EventType = 1 # KEY_EVENT
    $record.KeyEvent.bKeyDown = $true
    $record.KeyEvent.wVirtualKeyCode = 13 # Enter
    $records += $record

    $record = New-Object Kernel32.INPUT_RECORD
    $record.EventType = 1 # KEY_EVENT
    $record.KeyEvent.bKeyDown = $false
    $record.KeyEvent.wVirtualKeyCode = 13 # Enter
    $records += $record
}

# Write the INPUT_RECORD structures to stdin
$numWritten = 0
if (![Kernel32.ConsoleAPI]::WriteConsoleInput([System.IntPtr]::Zero, $records, $records.Length, [ref]$numWritten)) {
    Write-Error "Failed to write to console input."
}

# Detach from the console and free resources
[Kernel32.ConsoleAPI]::FreeConsole()
```

This script first loads the kernel32.dll library into PowerShell and defines a structure for the `INPUT_RECORD` and `KEY_EVENT_RECORD` types. It then attaches to an existing console using the `AttachConsole` API function, creates an array of lines to write to stdin, and converts them to `INPUT_RECORD` structures using the `KEY_EVENT_RECORD` info. Finally, it writes the structures to stdin using the `WriteConsoleInput` API function and detaches from the console using the `FreeConsole` API function.

[ME]:
#+end_ai

Ok, thats not super impressive. There is a lot of errors there. Lets give it an other try and ask it to explain it self.

#+begin_ai
[SYS]: You are an expert windows developer.

[ME]: Write a powershell wich uses the Console API in kernel32.dll to attach to a running console and write an array of lines into its stdin.
The script should take a process id, called PID, and an array of strings as arguments
After its finished it should detach and free the console again.
Please comment every line and explain why it is needed.


[AI]: Sure, here's a PowerShell script that uses the Console API in kernel32.dll to attach to a running console and write an array of lines into its stdin:

```powershell
# Load the Console API from kernel32.dll
Add-Type -Name ConsoleApi -Namespace Win32 -MemberDefinition "
[DllImport(\"kernel32.dll\")]
public static extern bool AttachConsole(int dwProcessId);
[DllImport(\"kernel32.dll\", SetLastError = true, CharSet = CharSet.Auto)]
public static extern IntPtr GetStdHandle(int nStdHandle);
[DllImport(\"kernel32.dll\", SetLastError = true)]
public static extern bool WriteConsole(IntPtr hConsoleOutput, string lpBuffer, uint nNumberOfCharsToWrite, out uint lpNumberOfCharsWritten, IntPtr lpReserved);
[DllImport(\"kernel32.dll\", SetLastError = true)]
public static extern bool FreeConsole();
"

# Get the process id and array of strings from the command line arguments
$pid = [int]$args[0]
$lines = $args[1..$($args.Count-1)]

# Attach to the console of the specified process
$consoleAttached = [Win32.ConsoleApi]::AttachConsole($pid)

if ($consoleAttached) {
    try {
        # Get the handle for the console's standard input
        $hStdIn = [Win32.ConsoleApi]::GetStdHandle(-10) # -10 = STD_INPUT_HANDLE

        if ($hStdIn -ne [System.IntPtr]::Zero) {
            # Write each line to the console's standard input
            foreach ($line in $lines) {
                [uint]$written = 0
                [Win32.ConsoleApi]::WriteConsole($hStdIn, $line, $line.Length, [ref]$written, [System.IntPtr]::Zero)
            }
        }
    } finally {
        # Detach from the console and free the console resources
        [void][Win32.ConsoleApi]::FreeConsole()
    }
} else {
    Write-Error "Failed to attach to console for process with id $pid"
}
```

Here's an explanation of what each line does:

- `Add-Type -Name ConsoleApi -Namespace Win32 -MemberDefinition "..."`: Loads the Console API from kernel32.dll into a new .NET type called `ConsoleApi` in the `Win32` namespace.
- `$pid = [int]$args[0]`: Gets the process id from the first command line argument and casts it to an integer.
- `$lines = $args[1..$($args.Count-1)]`: Gets an array of strings from the remaining command line arguments.
- `$consoleAttached = [Win32.ConsoleApi]::AttachConsole($pid)`: Attaches to the console of the specified process using the `AttachConsole` function from the Console API.
- `if ($consoleAttached) { ... }`: Checks if the console was successfully attached before proceeding.
- `$hStdIn = [Win32.ConsoleApi]::GetStdHandle(-10)`: Gets the handle for the console's standard input using the `GetStdHandle` function from the Console API and passing in the constant value `-10` to indicate the standard input handle.
- `if ($hStdIn -ne [System.IntPtr]::Zero) { ... }`: Checks if the standard input handle was successfully obtained before proceeding.
- `foreach ($line in $lines) { ... }`: Loops through each line of input and writes it to the console's standard input using the `WriteConsole` function from the Console API.
- `[void][Win32.ConsoleApi]::FreeConsole()`: Detaches from the console and frees the console resources using the `FreeConsole` function from the Console API.
- `Write-Error "Failed to attach to console for process with id $pid"`: Displays an error message if attaching to the console fails.

[ME]: 
#+end_ai

#+begin_src csharp :tangle WriteToConsole.ps1
# Load the Console API from kernel32.dll
Add-Type -Name ConsoleApi -Namespace Win32 -MemberDefinition "
[DllImport(\"kernel32.dll\")]
public static extern bool AttachConsole(int dwProcessId);
[DllImport(\"kernel32.dll\", SetLastError = true, CharSet = CharSet.Auto)]
public static extern IntPtr GetStdHandle(int nStdHandle);
[DllImport(\"kernel32.dll\", SetLastError = true)]
public static extern bool WriteConsole(IntPtr hConsoleOutput, string lpBuffer, uint nNumberOfCharsToWrite, out uint lpNumberOfCharsWritten, IntPtr lpReserved);
[DllImport(\"kernel32.dll\", SetLastError = true)]
public static extern bool FreeConsole();
"

# Get the process id and array of strings from the command line arguments
$pid = [int]$args[0]
$lines = $args[1..$($args.Count-1)]

# Attach to the console of the specified process
$consoleAttached = [Win32.ConsoleApi]::AttachConsole($pid)

if ($consoleAttached) {
    try {
        # Get the handle for the console's standard input
        $hStdIn = [Win32.ConsoleApi]::GetStdHandle(-10) # -10 = STD_INPUT_HANDLE

        if ($hStdIn -ne [System.IntPtr]::Zero) {
            # Write each line to the console's standard input
            foreach ($line in $lines) {
                [uint]$written = 0
                [Win32.ConsoleApi]::WriteConsole($hStdIn, $line, $line.Length, [ref]$written, [System.IntPtr]::Zero)
            }
        }
    } finally {
        # Detach from the console and free the console resources
        [void][Win32.ConsoleApi]::FreeConsole()
    }
} else {
    Write-Error "Failed to attach to console for process with id $pid"
}
#+end_src

Hum, Well that might be something! I don't really know since I'm writing this on my own computer running linux and testing...

